ClearDotX/TRK-KEA8_128/LINStack/Examples/General_Demo_Application/QD4_SlaveB/Project_Headers/mc9s08qd4.h
/*** NVOPT - Nonvolatile Flash Options Register; 0x0000FFBF ***/
typedef union {
  byte Byte;
  struct {
    byte SEC00       :1;                                       /* Security State Code, bit 0 */
    byte SEC01       :1;                                       /* Security State Code, bit 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte FNORED      :1;                                       /* Vector Redirection Disable */
    byte KEYEN       :1;                                       /* Backdoor Key Mechanism Enable */
  } Bits;
  struct {
    byte grpSEC0 :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} NVOPTSTR;
/* Tip for register initialization in the user code:  const byte NVOPT_INIT @0x0000FFBF = <NVOPT_INITVAL>; */
#define _NVOPT (*(const NVOPTSTR * __far)0x0000FFBF)
#define NVOPT                           _NVOPT.Byte
#define NVOPT_SEC00                     _NVOPT.Bits.SEC00
#define NVOPT_SEC01                     _NVOPT.Bits.SEC01
#define NVOPT_FNORED                    _NVOPT.Bits.FNORED
#define NVOPT_KEYEN                     _NVOPT.Bits.KEYEN
#define NVOPT_SEC0                      _NVOPT.MergedBits.grpSEC0

#define NVOPT_SEC00_MASK                1U
#define NVOPT_SEC01_MASK                2U
#define NVOPT_FNORED_MASK               64U
#define NVOPT_KEYEN_MASK                128U
#define NVOPT_SEC0_MASK                 3U
#define NVOPT_SEC0_BITNUM               0U



/* Flash commands */
#define mBlank                          0x05
#define mBurstProg                      0x25
#define mByteProg                       0x20
#define mMassErase                      0x41
#define mPageErase                      0x40


/***********************************************/
/**   D E P R E C I A T E D   S Y M B O L S   **/
/***********************************************/
/* --------------------------------------------------------------------------- */
/* The following symbols were removed, because they were invalid or irrelevant */
/* --------------------------------------------------------------------------- */
/*
 * Follows changes from the database 2.87.008 version */
#define ADC1SC1                          ADCSC1
#define ADC1SC1_ADCH0                    ADCSC1_ADCH0
#define ADC1SC1_ADCH0_MASK               ADCSC1_ADCH0_MASK
#define ADC1SC1_ADCH1                    ADCSC1_ADCH1
#define ADC1SC1_ADCH1_MASK               ADCSC1_ADCH1_MASK
#define ADC1SC1_ADCH2                    ADCSC1_ADCH2
#define ADC1SC1_ADCH2_MASK               ADCSC1_ADCH2_MASK
#define ADC1SC1_ADCH3                    ADCSC1_ADCH3
#define ADC1SC1_ADCH3_MASK               ADCSC1_ADCH3_MASK
#define ADC1SC1_ADCH4                    ADCSC1_ADCH4
#define ADC1SC1_ADCH4_MASK               ADCSC1_ADCH4_MASK
#define ADC1SC1_ADCO                     ADCSC1_ADCO
#define ADC1SC1_ADCO_MASK                ADCSC1_ADCO_MASK
#define ADC1SC1_AIEN                     ADCSC1_AIEN
#define ADC1SC1_AIEN_MASK                ADCSC1_AIEN_MASK
#define ADC1SC1_COCO                     ADCSC1_COCO
#define ADC1SC1_COCO_MASK                ADCSC1_COCO_MASK
#define ADC1SC1_ADCH                     ADCSC1_ADCH
#define ADC1SC1_ADCH_BITNUM              ADCSC1_ADCH_BITNUM
#define ADC1SC1_ADCH_MASK                ADCSC1_ADCH_MASK
#define ADC1SC2                          ADCSC2
#define ADC1SC2_ACFGT                    ADCSC2_ACFGT
#define ADC1SC2_ACFGT_MASK               ADCSC2_ACFGT_MASK
#define ADC1SC2_ACFE                     ADCSC2_ACFE
#define ADC1SC2_ACFE_MASK                ADCSC2_ACFE_MASK
#define ADC1SC2_ADTRG                    ADCSC2_ADTRG
#define ADC1SC2_ADTRG_MASK               ADCSC2_ADTRG_MASK
#define ADC1SC2_ADACT                    ADCSC2_ADACT
#define ADC1SC2_ADACT_MASK               ADCSC2_ADACT_MASK
#define ADC1RH                           ADCRH
#define ADC1RH_ADR8                      ADCRH_ADR8
#define ADC1RH_ADR8_MASK                 ADCRH_ADR8_MASK
#define ADC1RH_ADR9                      ADCRH_ADR9
#define ADC1RH_ADR9_MASK                 ADCRH_ADR9_MASK
#define ADC1RH_ADR_8                     ADCRH_ADR_8
#define ADC1RH_ADR_8_BITNUM              ADCRH_ADR_8_BITNUM
#define ADC1RH_ADR_8_MASK                ADCRH_ADR_8_MASK
#define ADC1R                            ADCR
#define ADC1RL                           ADCRL
#define ADC1RL_ADR0                      ADCRL_ADR0
#define ADC1RL_ADR0_MASK                 ADCRL_ADR0_MASK
#define ADC1RL_ADR1                      ADCRL_ADR1
#define ADC1RL_ADR1_MASK                 ADCRL_ADR1_MASK
#define ADC1RL_ADR2                      ADCRL_ADR2
#define ADC1RL_ADR2_MASK                 ADCRL_ADR2_MASK
#define ADC1RL_ADR3                      ADCRL_ADR3
#define ADC1RL_ADR3_MASK                 ADCRL_ADR3_MASK
#define ADC1RL_ADR4                      ADCRL_ADR4
#define ADC1RL_ADR4_MASK                 ADCRL_ADR4_MASK
#define ADC1RL_ADR5                      ADCRL_ADR5
#define ADC1RL_ADR5_MASK                 ADCRL_ADR5_MASK
#define ADC1RL_ADR6                      ADCRL_ADR6
#define ADC1RL_ADR6_MASK                 ADCRL_ADR6_MASK
#define ADC1RL_ADR7                      ADCRL_ADR7
#define ADC1RL_ADR7_MASK                 ADCRL_ADR7_MASK
#define ADC1CVH                          ADCCVH
#define ADC1CVH_ADCV8                    ADCCVH_ADCV8
#define ADC1CVH_ADCV8_MASK               ADCCVH_ADCV8_MASK
#define ADC1CVH_ADCV9                    ADCCVH_ADCV9
#define ADC1CVH_ADCV9_MASK               ADCCVH_ADCV9_MASK
#define ADC1CVH_ADCV_8                   ADCCVH_ADCV_8
#define ADC1CVH_ADCV_8_BITNUM            ADCCVH_ADCV_8_BITNUM
#define ADC1CVH_ADCV_8_MASK              ADCCVH_ADCV_8_MASK
#define ADC1CV                           ADCCV
#define ADC1CVL                          ADCCVL
#define ADC1CVL_ADCV0                    ADCCVL_ADCV0
#define ADC1CVL_ADCV0_MASK               ADCCVL_ADCV0_MASK
#define ADC1CVL_ADCV1                    ADCCVL_ADCV1
#define ADC1CVL_ADCV1_MASK               ADCCVL_ADCV1_MASK
#define ADC1CVL_ADCV2                    ADCCVL_ADCV2
#define ADC1CVL_ADCV2_MASK               ADCCVL_ADCV2_MASK
#define ADC1CVL_ADCV3                    ADCCVL_ADCV3
#define ADC1CVL_ADCV3_MASK               ADCCVL_ADCV3_MASK
#define ADC1CVL_ADCV4                    ADCCVL_ADCV4
#define ADC1CVL_ADCV4_MASK               ADCCVL_ADCV4_MASK
#define ADC1CVL_ADCV5                    ADCCVL_ADCV5
#define ADC1CVL_ADCV5_MASK               ADCCVL_ADCV5_MASK
#define ADC1CVL_ADCV6                    ADCCVL_ADCV6
#define ADC1CVL_ADCV6_MASK               ADCCVL_ADCV6_MASK
#define ADC1CVL_ADCV7                    ADCCVL_ADCV7
#define ADC1CVL_ADCV7_MASK               ADCCVL_ADCV7_MASK
#define ADC1CFG                          ADCCFG
#define ADC1CFG_ADICLK0                  ADCCFG_ADICLK0
#define ADC1CFG_ADICLK0_MASK             ADCCFG_ADICLK0_MASK
#define ADC1CFG_ADICLK1                  ADCCFG_ADICLK1
#define ADC1CFG_ADICLK1_MASK             ADCCFG_ADICLK1_MASK
#define ADC1CFG_MODE0                    ADCCFG_MODE0
#define ADC1CFG_MODE0_MASK               ADCCFG_MODE0_MASK
#define ADC1CFG_MODE1                    ADCCFG_MODE1
#define ADC1CFG_MODE1_MASK               ADCCFG_MODE1_MASK
#define ADC1CFG_ADLSMP                   ADCCFG_ADLSMP
#define ADC1CFG_ADLSMP_MASK              ADCCFG_ADLSMP_MASK
#define ADC1CFG_ADIV0                    ADCCFG_ADIV0
#define ADC1CFG_ADIV0_MASK               ADCCFG_ADIV0_MASK
#define ADC1CFG_ADIV1                    ADCCFG_ADIV1
#define ADC1CFG_ADIV1_MASK               ADCCFG_ADIV1_MASK
#define ADC1CFG_ADLPC                    ADCCFG_ADLPC
#define ADC1CFG_ADLPC_MASK               ADCCFG_ADLPC_MASK
#define ADC1CFG_ADICLK                   ADCCFG_ADICLK
#define ADC1CFG_ADICLK_BITNUM            ADCCFG_ADICLK_BITNUM
#define ADC1CFG_ADICLK_MASK              ADCCFG_ADICLK_MASK
#define ADC1CFG_MODE                     ADCCFG_MODE
#define ADC1CFG_MODE_BITNUM              ADCCFG_MODE_BITNUM
#define ADC1CFG_MODE_MASK                ADCCFG_MODE_MASK
#define ADC1CFG_ADIV                     ADCCFG_ADIV
#define ADC1CFG_ADIV_BITNUM              ADCCFG_ADIV_BITNUM
#define ADC1CFG_ADIV_MASK                ADCCFG_ADIV_MASK
#define ADC1RH_ADR                       ADCRH_ADR
#define ADC1CVH_ADCV                     ADCCVH_ADCV

#define Vadc                             Vadc1
#define Vkeyboard                        Vkeyboard1
#define Vtpmovf                          Vtpm1ovf
#define Vtpmch1                          Vtpm1ch1
#define Vtpmch0                          Vtpm1ch0

#define TPM2CNTH_BIT8_MASK               This_symb_has_been_depreciated
#define TPM2CNTH_BIT9_MASK               This_symb_has_been_depreciated
#define TPM2CNTH_BIT10_MASK              This_symb_has_been_depreciated
#define TPM2CNTH_BIT11_MASK              This_symb_has_been_depreciated
#define TPM2CNTH_BIT12_MASK              This_symb_has_been_depreciated
#define TPM2CNTH_BIT13_MASK              This_symb_has_been_depreciated
#define TPM2CNTH_BIT14_MASK              This_symb_has_been_depreciated
#define TPM2CNTH_BIT15_MASK              This_symb_has_been_depreciated
#define TPM2CNTH_BIT8                    This_symb_has_been_depreciated
#define TPM2CNTH_BIT9                    This_symb_has_been_depreciated
#define TPM2CNTH_BIT10                   This_symb_has_been_depreciated
#define TPM2CNTH_BIT11                   This_symb_has_been_depreciated
#define TPM2CNTH_BIT12                   This_symb_has_been_depreciated
#define TPM2CNTH_BIT13                   This_symb_has_been_depreciated
#define TPM2CNTH_BIT14                   This_symb_has_been_depreciated
#define TPM2CNTH_BIT15                   This_symb_has_been_depreciated
#define TPM2CNTL_BIT0_MASK               This_symb_has_been_depreciated
#define TPM2CNTL_BIT1_MASK               This_symb_has_been_depreciated
#define TPM2CNTL_BIT2_MASK               This_symb_has_been_depreciated
#define TPM2CNTL_BIT3_MASK               This_symb_has_been_depreciated
#define TPM2CNTL_BIT4_MASK               This_symb_has_been_depreciated
#define TPM2CNTL_BIT5_MASK               This_symb_has_been_depreciated
#define TPM2CNTL_BIT6_MASK               This_symb_has_been_depreciated
#define TPM2CNTL_BIT7_MASK               This_symb_has_been_depreciated
#define TPM2CNTL_BIT0                    This_symb_has_been_depreciated
#define TPM2CNTL_BIT1                    This_symb_has_been_depreciated
#define TPM2CNTL_BIT2                    This_symb_has_been_depreciated
#define TPM2CNTL_BIT3                    This_symb_has_been_depreciated
#define TPM2CNTL_BIT4                    This_symb_has_been_depreciated
#define TPM2CNTL_BIT5                    This_symb_has_been_depreciated
#define TPM2CNTL_BIT6                    This_symb_has_been_depreciated
#define TPM2CNTL_BIT7                    This_symb_has_been_depreciated
#define TPM2MODH_BIT8_MASK               This_symb_has_been_depreciated
#define TPM2MODH_BIT9_MASK               This_symb_has_been_depreciated
#define TPM2MODH_BIT10_MASK              This_symb_has_been_depreciated
#define TPM2MODH_BIT11_MASK              This_symb_has_been_depreciated
#define TPM2MODH_BIT12_MASK              This_symb_has_been_depreciated
#define TPM2MODH_BIT13_MASK              This_symb_has_been_depreciated
#define TPM2MODH_BIT14_MASK              This_symb_has_been_depreciated
#define TPM2MODH_BIT15_MASK              This_symb_has_been_depreciated
#define TPM2MODH_BIT8                    This_symb_has_been_depreciated
#define TPM2MODH_BIT9                    This_symb_has_been_depreciated
#define TPM2MODH_BIT10                   This_symb_has_been_depreciated
#define TPM2MODH_BIT11                   This_symb_has_been_depreciated
#define TPM2MODH_BIT12                   This_symb_has_been_depreciated
#define TPM2MODH_BIT13                   This_symb_has_been_depreciated
#define TPM2MODH_BIT14                   This_symb_has_been_depreciated
#define TPM2MODH_BIT15                   This_symb_has_been_depreciated
#define TPM2MODL_BIT0_MASK               This_symb_has_been_depreciated
#define TPM2MODL_BIT1_MASK               This_symb_has_been_depreciated
#define TPM2MODL_BIT2_MASK               This_symb_has_been_depreciated
#define TPM2MODL_BIT3_MASK               This_symb_has_been_depreciated
#define TPM2MODL_BIT4_MASK               This_symb_has_been_depreciated
#define TPM2MODL_BIT5_MASK               This_symb_has_been_depreciated
#define TPM2MODL_BIT6_MASK               This_symb_has_been_depreciated
#define TPM2MODL_BIT7_MASK               This_symb_has_been_depreciated
#define TPM2MODL_BIT0                    This_symb_has_been_depreciated
#define TPM2MODL_BIT1                    This_symb_has_been_depreciated
#define TPM2MODL_BIT2                    This_symb_has_been_depreciated
#define TPM2MODL_BIT3                    This_symb_has_been_depreciated
#define TPM2MODL_BIT4                    This_symb_has_been_depreciated
#define TPM2MODL_BIT5                    This_symb_has_been_depreciated
#define TPM2MODL_BIT6                    This_symb_has_been_depreciated
#define TPM2MODL_BIT7                    This_symb_has_been_depreciated
#define TPM2C0VH_BIT8_MASK               This_symb_has_been_depreciated
#define TPM2C0VH_BIT9_MASK               This_symb_has_been_depreciated
#define TPM2C0VH_BIT10_MASK              This_symb_has_been_depreciated
#define TPM2C0VH_BIT11_MASK              This_symb_has_been_depreciated
#define TPM2C0VH_BIT12_MASK              This_symb_has_been_depreciated
#define TPM2C0VH_BIT13_MASK              This_symb_has_been_depreciated
#define TPM2C0VH_BIT14_MASK              This_symb_has_been_depreciated
#define TPM2C0VH_BIT15_MASK              This_symb_has_been_depreciated
#define TPM2C0VH_BIT8                    This_symb_has_been_depreciated
#define TPM2C0VH_BIT9                    This_symb_has_been_depreciated
#define TPM2C0VH_BIT10                   This_symb_has_been_depreciated
#define TPM2C0VH_BIT11                   This_symb_has_been_depreciated
#define TPM2C0VH_BIT12                   This_symb_has_been_depreciated
#define TPM2C0VH_BIT13                   This_symb_has_been_depreciated
#define TPM2C0VH_BIT14                   This_symb_has_been_depreciated
#define TPM2C0VH_BIT15                   This_symb_has_been_depreciated
#define TPM2C0VL_BIT0_MASK               This_symb_has_been_depreciated
#define TPM2C0VL_BIT1_MASK               This_symb_has_been_depreciated
#define TPM2C0VL_BIT2_MASK               This_symb_has_been_depreciated
#define TPM2C0VL_BIT3_MASK               This_symb_has_been_depreciated
#define TPM2C0VL_BIT4_MASK               This_symb_has_been_depreciated
#define TPM2C0VL_BIT5_MASK               This_symb_has_been_depreciated
#define TPM2C0VL_BIT6_MASK               This_symb_has_been_depreciated
#define TPM2C0VL_BIT7_MASK               This_symb_has_been_depreciated
#define TPM2C0VL_BIT0                    This_symb_has_been_depreciated
#define TPM2C0VL_BIT1                    This_symb_has_been_depreciated
#define TPM2C0VL_BIT2                    This_symb_has_been_depreciated
#define TPM2C0VL_BIT3                    This_symb_has_been_depreciated
#define TPM2C0VL_BIT4                    This_symb_has_been_depreciated
#define TPM2C0VL_BIT5                    This_symb_has_been_depreciated
#define TPM2C0VL_BIT6                    This_symb_has_been_depreciated
#define TPM2C0VL_BIT7                    This_symb_has_been_depreciated


/* **** 3.3.2009 13:30:58 */

