ClearDotX/TRK-KEA8_128/LINStack/Examples/General_Demo_Application/QD4_SlaveB/Project_Headers/mc9s08qd4.h
#define VectorNumber_Reserved1           VectorNumber_VReserved22 
#define VectorNumber_Reserved2           VectorNumber_VReserved21
#define VectorNumber_Reserved3           VectorNumber_VReserved20 
#define VectorNumber_Reserved6           VectorNumber_VReserved17 
#define VectorNumber_Reserved7           VectorNumber_VReserved16 
#define VectorNumber_Reserved8           VectorNumber_VReserved15 
#define VectorNumber_Reserved9           VectorNumber_VReserved14 
#define VectorNumber_Reserved10          VectorNumber_VReserved13
#define VectorNumber_Reserved11          VectorNumber_VReserved12
#define VectorNumber_Reserved12          VectorNumber_VReserved11
#define VectorNumber_Reserved14          VectorNumber_VReserved9
#define VectorNumber_Reserved19          VectorNumber_VReserved4
#define Reserved1                        VReserved22
#define Reserved2                        VReserved21
#define Reserved3                        VReserved20
#define Reserved6                        VReserved17
#define Reserved7                        VReserved16
#define Reserved8                        VReserved15
#define Reserved9                        VReserved14
#define Reserved10                       VReserved13
#define Reserved11                       VReserved12
#define Reserved12                       VReserved11
#define Reserved14                       VReserved9 
#define Reserved19                       VReserved4
#endif
/*lint -restore  +esym(961,18.4) +esym(961,19.7) Enable MISRA rule (1.1,18.4,6.4,19.7) checking. */
